#+TITLE: EBoB: χ-estimates

#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:nil html-style:nil
#+OPTIONS: html5-fancy:t tex:t broken-links:mark H:5
#+OPTIONS: toc:2
#+STARTUP: hideblocks
#+HTML_DOCTYPE: html5
#+HTML_CONTAINER: div
#+LATEX_CLASS: dcnotebook
#+HTML_HEAD: <link rel="stylesheet" href="notebook.css" type="text/css" />

* misc :noexport:

#+NAME: ebob-summary
#+BEGIN_SRC ipython :session :noweb yes
<<nrl1-summary>>
<<nrl3-summary>>
<<nrl4-summary>>
<<nrl5-summary>>
#+END_SRC

#+BEGIN_SRC ipython :session :ipyfile images/temp/img4hr35z.png :results drawer
def ci(x):
    import scikits.bootstrap as sb
    err = xr.DataArray(sb.ci(x, np.nanmean)[np.newaxis], dims=['day', 'lh'])
    return err

KT = ra12.KT.sel(time='2014-06', depth=30)
KT.plot.line(lw=0.5)

day = KT.time.to_series().dt.floor('D').values
grps = KT.groupby(xr.DataArray(day, dims=['time'], name='day'))

# mean = grps.apply(ci)

grps.mean().plot(color='k')
err.plot.line('*', x='day')
plt.gca().set_yscale('log')
#+END_SRC

#+RESULTS:
:RESULTS:
:END:
